Table of Contents
 Class WeldParam
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Parameter which represts the record of the weld in IDEA MPRL
[DataContract]
[Serializable]
public class WeldParam : MprlRecord
Inheritance
object
MprlRecord
WeldParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Size
Gets or sets the size of the weld
[DataMember]
public double Size { get; set; }
Property Value
double
 WeldType
Gets or sets the type of the weld
[DataMember]
public WeldType WeldType { get; set; }
Property Value
WeldType
 Edit this page